history = (f'🛍️ ІСТОРІЯ СТВОРЕННЯ Noiric Shop \n\n'
              f'Все почалося з однієї простої ідеї: онлайн-шопінг має'
              f'бути зручним, особистим і без зайвої метушні. \n\n'
              f'Звичайні сайти переповнені рекламою, автоматичними відповідями'
              f' та шаблонним підходом. Це не те, що хотілося створити. Магазин мав'
              f' стати місцем, де кожен клієнт відчуває себе не просто покупцем, а'
              f' VIP-гостем, який може самостійно обирати речі або отримувати допомогу,'
              f' коли потрібно. \n\n'
              f'Так з’явилася концепція нашого Telegram-магазину:\n\n'
              f'🚀 Зручність як на сайті – хочеш швидко знайти товар? Лише кілька'
              f' кліків, і він перед тобою.\n\n'
              f'🤝 Живий консультант – а якщо потрібна порада чи підбір стилю,'
              f' продавець завжди поруч у Telegram, готовий допомогти.\n\n'
              f'⚡ Персоналізований підхід – тут кожен вибір має значення, а оформлення'
              f' замовлення проходить ретельно, щоб уникнути помилок.\n\n'
              f'Це не просто ще один магазин – це простір, де покупки стають комфортними,'
              f' а клієнти відчувають, що про них дбають. І це лише початок!')

hello_text = (f'👋 Вітаємо у Noiric Shop! \n\n'
              f'На відміну від звичайного сайту, тут ви самі обираєте'
              f' рівень обслуговування:\n'
              f'🔹 Хочете швидко знайти товар? Просто натискайте кнопки'
              f' та переглядайте каталог – усе як у класичному онлайн-магазині!  \n'
              f'🔹 Потрібна допомога з вибором? Ви завжди можете звернутися до нашого'
              f' продавця @DmytroChagayda – він допоможе, підкаже та оформить замовлення.'
              f'\n\n ⚠️ Замовлення проходять через продавця, щоб уникнути помилок і '
              f'гарантувати якість обслуговування. \n\n'
              f'💡 Обирайте, як вам зручніше, і давайте знайдемо '
              f'ідеальний товар саме для вас! 🚀  ')

media_text = (f'Наш магазин доступний одразу у двох форматах, щоб тобі було максимально зручно:\n\n'
              f'📲 Telegram-канал – тут ти знайдеш усі новинки, акції та зможеш переглянути каталог товарів без'
              f' зайвого шуму. А головне – у будь-який момент можеш написати нашому продавцю,'
              f' щоб отримати консультацію або допомогу з замовленням!\n\n'
              f' Instagram – стильні фото, реальні відгуки та найкращі комбінації товарів! '
              f'Якщо хочеш бачити речі в дії – тут усе для натхнення та вибору.\n'
              f'Де тобі зручніше? Обирай платформу та знаходь свій ідеальний товар! 🚀\n\n'
              f'Instagram ->  https://www.instagram.com/noiric_shop\n'
              f'Telegram-канал -> https://t.me/Noiric_Shop')

help_or_self = (f'🔹 Обирай сам, чи звертайся до продавця – '
                f'як тобі зручніше! 🔹')

help_text = (f'Чудово! За допомогою можеш звернутися до @DmytroChagayda, '
             f'він допоможе обрати речі саме для тебе😉')

all_or_search = (f'Чудово! Якщо ти знаєш, який товар конкретно тобі потрібен, тоді можеш знайти, '
                 f'а як ні, то подивись каталог товарів')

all_products = (f'Ось товати, які були в наявності '
                f'сьогодні в 00:01')

search_text = (f'Чудово, оберіть за яким параметром'
               f' будете шукати')

buy_text = (f'Для замовлення пишіть до @DmytroChagayda. \n'
            f'Є можливіть отримати знижку!!!')

search_by_brand = (f'Чудово! напишіть назву бренду. \n'
                   f'Наприклад: NewBalance чи Nike')

search_by_type = (f'Чудово! напишіть тип одягу. \n'
                   f'Наприклад: Шорти чи футболка')

search_by_season = (f'Чудово! напишіть сезон одягу. \n'
                   f'Наприклад: Літо чи осінь')

after_search = (f'Все, що є за вашим запросом перед вами, '
                f'очікую новий запрос')

negative_search = (f'Нажаль за вашим запросом нічого не знайшлось,'
                   f' очікую наступний запрос')
